Revit 2026 API

# PlasticVinylPlasticvinylColor Property

---

The property labeled "Color" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string PlasticvinylColor { get; }
```
```vb
Public Shared ReadOnly Property PlasticvinylColor As String
	Get
```
```cpp
public:
static property String^ PlasticvinylColor {
	String^ get ();
}
```
```fsharp
static member PlasticvinylColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace